app/Validation/UserRules.php

    public function validateUser(string $str,string $fields,array $data) {
        $model = new User();
        $user = $model->where('email', $data['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sals@gmail.com'
 LIMIT 1